void func1(int k);     //함수 원형 미리 선언. 이렇게 미리 선언해놓으면 func1 함수가 main함수 아래에 위치해도 가능.  

void func1(int k)    // 새로운 함수 선언. return값이 없는 함수(key를 입력하고 함수내에서 판별만하고 값을 리턴받지 않을 것이므로)  / 여기의 변수명과 아래 while 안에 func1()안의 변수명과 같을 이유가 없음.  / 다만 똑같은 int 데이터 타입 필요  
{
    if((k>='A') && (k<='Z'))    // 대문자인지 검사. ascii 코드값을 이용하여 검사. K>=65로 표기도 가능. and -> &&
	{
		printf(">%c : 대문자\n", k);
	  } 
	else if((k>='a') && (k<='z'))
	{
		printf(">%c : 소문자\n", k);
	 } 
	else if((k>='!' && k<='/') || (k>=':' && k<='@') || (k>='\[' && k<='`') || (k>='\{' && k<='~'))
	{
		printf(">%c : 특수문자\n", k);
	}
	else if(k>='0' && k<='9')
	{
		printf(">c% : 숫자\n", k);
	}
	
	
}
